[
    {
    "id": "1",
    "name" : "Shelters in BC",
    "image" :"/images/shelters2.png",
    "description": "Full-stack application developed for Advanced Web Programming with Javascript course as part of a team of three people. It displays information about shelters for homeless people en BC. The information is recevied throught an API request, and the  data is organized (cleaned) in  a database for showing in the front-end. At the same time users can add comments and new shelters that will be stored in the database.",
    "technologies": "React, CSS, Nodejs, Rest Api, JavaScript, MongoDB and Git",
    "source": "https://github.com/erikalls18/FullStack-Applicaction.git",
    "category": "app"

},
{    "id": "2",
    "name" : "GluControl App",
    "image" :"/images/Screenshot_appG1C.png",
    "description": "This application is designed to allow users to efficiently store and retrieve blood sugar level data. It enables users to input and access personal information, including glucose levels and medications. The purpose of this app is to help users maintain a record of their levels over time, facilitating a better understanding of their progress.",
    "technologies": "Android Studio, Java  and Room",
    "source": "https://github.com/erikalls18/GlucontrolApp.git",
    "category": "app"
    

},
{    "id": "3",
    "name" : "Portfolio",
    "image" :"/images/portfolio.png",
    "description": "This webpage serves as a comprehensive display of my primary background, skills, and projects. Here, you will find  an accurated collection that showcases my professional journey, highlighting my areas of expertise and the projects I've undertaken. Explore my portfolio to gain a deeper understanding of my experience and the value I can bring to various endeavors.",
    "technologies": "HTML,CSS, JavaScript, Nodejs and React",
    "source": "https://github.com/erikalls18/portfolio.git",
    "category": "app"
    


},

{    "id": "4",
    "name" : "Predicting Car Prices",
    "image" :"/images/linear12.png",
    "description": "This project aims to analyze the factors affecting car prices using various regression techniques. By employing Linear Regression, Ridge Regression, and Polynomial Regression, the goal is to identify and understand which variables—such as engine size, year of manufacture, and mileage—significantly influence car values. The project seeks to enhance predictive accuracy and model performance, ultimately providing insights into how different attributes impact car pricing",
     "technologies": "Python (Pandas, Matplotlib ) and Jupyter Notebbok",
     "source": "https://deepnote.com/app/ml-projects-961e/Linear-Regression-f2c845a9-c8e0-45cc-ad92-4ab31be662b8?__run=true",
     "category": "machine-learning"

},
{    "id": "5",
    "name" : " Predicting Bank Client Subscription",
    "image" :"/images/logistic4.png",
    "description": "This project involves developing and evaluating predictive models to determine if clients of a Portuguese bank will accept a term deposit. By using classification models like Random Forest, the project assesses the impact of feature selection on model accuracy and robustness. Two models are compared: one with 7 features, which slightly improves accuracy, and another with 6 features, which enhances recall and AUC of the ROC curve despite a minor drop in accuracy. The analysis highlights the need for techniques like oversampling to address dataset class imbalance and improve predictive performance",
    "technologies": "Python (Pandas, Matplotlib, Sklearn, Seaborn ) and Jupyter Notebbok",
    "source": "https://deepnote.com/app/ml-projects-961e/Logistic-Regression-6f23f623-e288-492b-bfba-aa98a14c6da5",
    "category": "machine-learning"

},

{    "id": "6",
    "name" : "FitTrack App ",
    "image" :"/images/fit_track.png",
    "description": "The objective of this application is to offer users an intuitive and efficient tool for managing their health and wellbeing. The app enables easy tracking and balancing of calories consumed from food and calories burned through physical activities. By leveraging APIs, it delivers accurate, personalized data to help users achieve their health and fitness goals.",
    "technologies": "Android Studio, Java, REST API and Firebase",
    "source": "https://github.com/erikalls18/FitTrack.git",
    "category": "app"
},

{    "id": "7",
    "name" : "HandyMan ",
    "image" :"/images/handy.png",
    "description": "The Job Matching Board is a full-stack application developed collaboratively by a team. It aims to streamline the process of connecting homeowners with skilled tradespeople for property repairs and renovations. This platform simplifies finding the right professionals—such as carpenters, plumbers, and electricians—by allowing homeowners to easily post their needs and match with qualified candidates.",
    "technologies": "Java, Spring Boot and  Vue.js",
    "source": "https://github.com/erikalls18/HandyMan.git",
    "category": "app"
},

{    "id": "8",
    "name" : " Prediction of Obesity",
    "image" :"/images/matrix.png",
    "description": "The main goal of this project is to create a predictive model to estimate the likelihood of obesity in individuals using various independent variables. We are particularly interested in factors that may contribute to obesity. The variables we consider include demographic details such as gender and age, dietary habits, family history of obesity, physical activity behaviors, and overall lifestyle",
    "technologies": "Python (Pandas, Matplotlib, Sklearn, Seaborn ) and Jupyter Notebbok",
    "source": "https://deepnote.com/app/ml-projects-961e/Predicting-Obesity-levels-72fe343e-3684-49a0-bd87-949d6ed12932",
    "category": "machine-learning"

}



]